{
    "dado": [
        {
            "questao": 1,
            "pergunta": "Qual das seguintes respostas descreve uma condiçao de teste?",
            "alternativa": [
                {
                    "opcao": "A",
                    "respostass": "Uma característica distinta de um componente ou sistema"
                },
                {
                    "opcao": "B",
                    "respostass": "Um aspecto testável de um componente ou sistema identificado como base para os testes"
                },
                {
                    "opcao": "C",
                    "respostass": "O grau em que um produto de software fornece funções que atendem as necessidades declaradas e implícitas quando o software e utilizado sob condiçoes específicas"
                },
                {
                    "opcao": "D",
                    "respostass": "Casos de teste projetados para executar combinações de condições e ações resultantes delas"
                }
            ]
        },
        {
            "questao": 2,
            "pergunta": "Qual das seguintes declarações e um objetivo válido para os testes?",
            "alternativa": [
                {
                    "opcao": "A",
                    "respostass": "O teste deve começar o mais tarde possível para que o desenvolvimento tenha tempo suficiente para criar um bom produto"
                },
                {
                    "respostass": "B",
                    "pergunta": "Para validar se o objeto de teste funciona como esperado pelos usuarios e outras partes interessadas"
                },
                {
                    "opcao": "C",
                    "respostass": "Para validar se o objeto de teste funciona como esperado pelos usuarios e outras partes interessadas"
                },
                {
                    "opcao": "D",
                    "respostass": "Para provar que qualquer defeito remanescente nao causará nenhuma falha"
                }
            ]
        },
        {
            "questao": 3,
            "pergunta": "Qual das seguintes declarações descreve corretamente a diferença entre teste e depuração?",
            "alternativa": [
                {
                    "opcao": "A",
                    "respostass": "Os testes identificam a fonte dos defeitos; a depuração analisa os defeitos e propo e atividades de prevençao"
                },
                {
                    "opcao": "B",
                    "respostass": "Os testes dinâmicos mostram falhas causadas por defeitos; a depuração elimina os defeitos, que sa o a fonte das falhas"
                },
                {
                    "opcao": "C",
                    "respostass": "Os testes na o removem as falhas; mas a depuração remove os defeitos que causam as falhas"
                },
                {
                    "opcao": "D",
                    "respostass": "OS testes dinâmicos previnem as causas das falhas; a depuração remove as falhas"
                }
            ]
        },
        {
            "questao": 4,
            "pergunta": "Qual das declarações abaixo descreve a situação mais comum para uma falha descoberta durante os testes ou na produção?",
            "alternativa": [
                {
                    "opcao": "A",
                    "pergunta": "O produto falhou quando o usua rio selecionou uma opção em uma caixa de dia logo"
                },
                {
                    "opcao": "B",
                    "pergunta": "A versa o errada de um arquivo de co digo fonte compilado foi incluí da na compilaçao"
                },
                {
                    "opcao": "C",
                    "pergunta": "O algoritmo de computaça o utilizou as varia veis de entrada erradas"
                },
                {
                    "opcao": "D",
                    "pergunta": "O desenvolvedor interpretou erroneamente a exige ncia do algoritmo"
                }
            ]
        },
        {
            "questao": 5,
            "pergunta": "O Sr. Test tem testado aplicações de software em dispositivos moveis por um perí odo de 5 anos. Ele tem uma grande experiência em testar aplicações moveis e alcançar melhores resultados em um tempo mais curto do que outros. Durante vários meses, o Sr. Test na o modificou os casos de testes automatizados existentes e na o criou casos de testes. Isto leva a que cada vez menos defeitos sejam encontrados atrave s da execuça o dos testes. Que princí pio de teste o Sr. Test na o observou?",
            "alternativa": [
                {
                    "opcao": "A",
                    "respostass": "Os testes dependem do ambiente"
                },
                {
                    "opcao": "B",
                    "respostass": "Não e possível realizar testes exaustivos"
                },
                {
                    "opcao": "C",
                    "respostass": "A repetição dos mesmos testes não encontrara novos defeitos"
                },
                {
                    "opcao": "D",
                    "respostass": "Defeitos agrupados"
                }
            ]
        },
        {
            "questao": 6,
            "pergunta": "De que forma os testes podem ser parte da Garantia de Qualidade?",
            "alternativa": [
                {
                    "opcao": "A",
                    "respostass": "Ela garante que os requisitos sejam suficientemente detalhados"
                },
                {
                    "opcao": "B",
                    "respostass": "Os testes reduzem o risco de ma Qualidade do software"
                },
                {
                    "opcao": "C",
                    "respostass": "Assegura que as normas da organizaça o sejam seguidas"
                },
                {
                    "opcao": "D",
                    "respostass": "Mede a Qualidade do software em termos de nu mero de casos de teste executados"
                }
            ]
        },
		{
            "questao": 7,
            "pergunta": "Qual das seguintes atividades faz parte da atividade principal análise de teste no processo de teste?",
            "alternativa": [
                {
                    "opcao": "A",
                    "respostass": "Identificaça o de Qualquer infraestrutura e ferramentas necessa rias"
                },
                {
                    "opcao": "B",
                    "respostass": "Criaça o de conjuntos de teste a partir de scripts de teste"
                },
                {
                    "opcao": "C",
                    "respostass": "análise das liço es aprendidas para a melhoria do processo"
                },
                {
                    "opcao": "D",
                    "respostass": "Avaliando a base de teste de testabilidade"
                }
            ]
		},
		{
            "questao": 8,
            "pergunta": [
				"Qual das seguintes atividades faz parte da atividade principal análise de teste no processo de teste?<br>",
				"(1) Conjunto de teste<br>",
				"(2) Caso de teste<br>",
				"(3) Roteiro de teste<br",
				"(4) Carta de teste<br>",
				"(a) Um conjunto de scripts de teste a serem executados em uma execução de teste específica<br>",
				"(b) Um conjunto de instruço es para a execução de um teste<br>",
				"(c) Contem os resultados esperados<br>",
				"(d) DocumentAção das atividades de teste em testes exploratários baseados em sessões<br>"
			],
			
            "alternativa": [
                {
                    "opcao": "A",
                    "respostass": "1A, 2C, 3B, 4D"
                },
                {
                    "opcao": "B",
                    "respostass": "1D, 2B, 3A, 4C"
                },
                {
                    "opcao": "C",
                    "respostass": "1A, 2C, 3D, 4B"
                },
                {
                    "opcao": "D",
                    "respostass": "1D, 2C, 3B, 4A"
                }
            ]
		}
    ]
}